{
    "name": "Tze Hng Loke",
    "headerTaglineOne": "Tze Hng Loke",
    "showBlog": false,
    "darkMode": true,
    "showResume" : true,
    "socials": [
      {
        "id": "1",
        "title": "Github",
        "link": "https://github.com/Icyviolet23"
      },
      {
        "id": "2",
        "title": "LinkedIn",
        "link": "https://www.linkedin.com/in/tzehng/"
      }
    ],
    "projects": [
      {
        "id": "1",
        "title": "Optiver Ready Trader Go",
        "description": "Top 32 out of 7500 participants in Optiver's global algorithmic trading competition. Optimized Avellaneda and Stoikov’s market making strategy in low latency C++.",
        "imageSrc": "/images/rtg.jpg",
        "url": "https://github.com/Icyviolet23/OptiverRTG_genericsegtree"
      },
      {
        "id": "2",
        "title": "FTX Trading Competition",
        "description": "Outperformed all 35 teams and over 135 participants. Traded 1.5 million USD in cryptocurrencies over 1.5 months with a profitable record of 39/45 days using a algorithmic trading bot implemented in Python.",
        "imageSrc": "/images/ftx.jpg",
        "url": "https://github.com/Icyviolet23/FTX-Exit_Liquidity"
      },
      {
        "id": "3",
        "title": "BotMD",
        "description": "My First Experience with Android App Development",
        "imageSrc": "https://miro.medium.com/v2/resize:fit:640/format:webp/1*dad_ogdkSw6GrToWzrNJ-g.jpeg",
        "url": "https://blog.botmd.com/interns-diary-my-first-experience-with-android-app-development-e867419c4f41"
      },
      {
        "id": "4",
        "title": "SleepBuddy",
        "description": "Figma Best Design Award @ Tartanhacks2022, Carnegie Mellon University's largest hackathon. Gamified mobile application aiming to incentivize users to maintain a healthy sleep schedule. Built using Flutter.",
        "imageSrc": "/images/sleep_buddy.png",
        "url": "https://www.youtube.com/watch?v=rizfjVbPnFM&ab_channel=TjunJetOng"
      },
      {
        "id": "5",
        "title": "HealthFind",
        "description": "Application which aims to help users locate the nearest hospital, dialysis clinc or COVID lab from their current location",
        "imageSrc": "/images/health_magnifying.png",
        "url": "https://github.com/Icyviolet23/HealthFind"
      },

      {
        "id": "6",
        "title": "Bomb it",
        "description": "Python project based on the popular games Bomb It 4 and Playing with Fire. Grid-based game like Bomberman using algorithms like Dijkstra, Breath-first search, Depth-first search, Prim’s, Kruskal’s for maze generation and AI pathfinding.",
        "imageSrc": "/images/Bomberman.jpg",
        "url": "https://www.youtube.com/watch?v=6F3a4sm5Csw&ab_channel=TzeHngLoke"
      }
    ],
    "services": [
    ],
    "aboutpara": "Hi! I'm Tze Hng, currently a Computer Science undergraduate @ Carnegie Mellon University. I am passionate about solving challenging problems in the fields of Computer Science and Quantitative Finance. I am particularly interested in topics involving both technology and finance and I enjoy learning more by taking part in hackathons and algorithmic trading competitions! ",
    "resume": {
      "tagline": "I am a Computer Science undergraduate @ Carnegie Mellon University. I am passionate about technology and quantitative finance and I enjoy building cool applications!",
      "experiences": [
        {
          "id": "1",
          "dates": "Citadel Securities",
          "type": "June 2024 - Present",
          "position": "Software Engineering Intern",
          "bullets": ["Created python tool that speeds up data ingestion pipeline for regulatory data by 50x.", "Implemented amendment tool that allows desks to amend tens of millions of erroneous transaction records in half the time."]
        },
        {
          "id": "2",
          "dates": "Amazon Inc.",
          "type": "June 2023 - August 2023",
          "position": "Software Development Engineering Intern",
          "bullets": ["Developed new end-user facing features in React Native for Amazon Fire TV’s main page used by over 50 million active users monthly.", "Integrated a new React Native visualization tool that reduces debugging time by over 80%."]
        },
        {
          "id": "3",
          "dates": "Carnegie Mellon University",
          "type": "August 2022 - May 2023",
          "position": "Teaching Assistant",
          "bullets": ["Mentored over 60+ students weekly in mastering Data Structures and Algorithms in C."]
        },
        {
            "id": "4",
            "dates": "Botmd",
            "type": "May 2022 - August 2022",
            "position": "Software Engineering Intern",
            "bullets": ["Ensured integrity and robustness of code by developing an automated testing framework for Botmd’s android app using Espresso, Kotlin, Java, Gradle and Android Studio, detecting 25% more bugs.", "Integrated framework with CI/CD pipeline run over 50 times daily, reducing application crashes by 30%.", "Created a brand new web application using React and Google Maps API, enabling over 15,000 users in the Philippines to find the nearest hospitals and clinics in real time."]
        },
        {
            "id": "5",
            "dates": "GIC Private Limited",
            "type": "December 2020 - July 2021",
            "position": "Junior Data Platforms Engineer",
            "bullets": ["Spearheaded development of data pipeline that analyzed key insights from over 10 million data points from GIC’s search engine, used by over 1500 employees, using Python, Tableau, PySpark, SQL and Solr.", "Created 10 dashboards that increased search relevance by 50% and decreased costs by 30%."]
        }
      ],
      "competition": [{
        "id": "1",
        "dates": "Optiver’s Ready Trader Go",
        "type": "2023",
        "position": "Top 1%",
        "bullets": ["Top 1%, top 32 out of 2800 teams of 3 for Optiver's global trading challenge (Ready Trader Go) involving undergraduates & post-graduates from the US, EU and Asia Pacific.", "Developed and tuned algorithmic trading bot using the Avellaneda and Stoikov's market making strategy in low latency C++."]
      },
      {
        "id": "2",
        "dates": "IMC Prosperity Global Trading Challenge",
        "type": "2023",
        "position": "Top 3%",
        "bullets": ["Top 3% out of 2000 teams of 5 for IMC's global trading challenge (IMC Prosperity) involving undergraduates & post-graduates from the US, EU and Asia Pacific.", "Developed algorithmic trading bot incorporating various strategies such as Pairs Trading and Avellaneda and Stoikov's market making strategy in Python.", "Optimized strategies based on market data as well as news forecasts provided during the competition."]
      },
      {
        "id": "3",
        "dates": "FTX Trading Competition",
        "type": "2022",
        "position": "Overall Champions",
        "bullets": ["1st place out of 35 teams with over 135 participants at FTX's trading competition.", "Traded 1.5 million USD in cryptocurrencies over 1.5 months with a profitable record of 39/45 days using a algorithmic trading bot implemented in Python."]
      },
      {
        "id": "4",
        "dates": "Optiver Market Making Game",
        "type": "2022",
        "position": "1st Place",
        "bullets": ["First place out of 30 teams for Price Estimation with over 150 participants.", "Applied mathematical concepts to estimate intrinsic value of contracts to within 10% error."]
      }],
      "languages": ["C", "C++", "CSS", "HTML", "Java", "JavaScript", "Kotlin", "Python", "Pyspark", "SML", "SQL", "TypeScript"],
      "machineLearning": ["Keras", "Numpy", "Pandas", "PyTorch", "Scipy", "Sklearn", "Tensorflow", "Time Series", "XGBoost"],
      "softwareEngineering": ["Android Studio", "Django", "Espresso", "Firebase", "Flask", "Flutter", "NodeJS", "React", "React Native"]
    }
  }
  